TP: 0.7948164146868251
TN: 0.902931508687194
正确率： 0.8754
TP: 0.7974512454141727
TN: 0.903717697861143
正确率： 0.8762
TP: 0.7994574694826584
TN: 0.8990498011995417
正确率： 0.87335
TP: 0.7975341937969562
TN: 0.9001958268620434
正确率： 0.87355
TP: 0.794180407371484
TN: 0.9017851128326035
正确率： 0.87405
TP: 0.7942564909520063
TN: 0.8999731831590239
正确率： 0.8731
TP: 0.79375
TN: 0.9003360215053764
正确率： 0.87305
TP: 0.7934272300469484
TN: 0.8971655024180548
正确率： 0.87065
TP: 0.7925407925407926
TN: 0.9005521141933747
正确率： 0.87275
TP: 0.797420634920635
TN: 0.8975267379679145
正确率： 0.8723
class Solution:
    # @param n, an integer
    # @return an integer
    def reverseBits(self, n):
        temp = []
        while n:
            if n % 2:
                temp.append(0)
            else:
                temp.append(1)
            print(n, temp[-1])
            n = n // 2
        print(temp)
        res = 0
        for i in temp:
            res = res * 2 + i
        res1 = 0
        temp.reverse()
        for i in temp:
            res1 = res1 * 2 + i
        print(res1)
        return res